
__author__ = 'Korotkov Andrey'

#  Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную
# или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

a = input("Введите первое число - ")
b = input("Введите второе число - ")
c = a
a = b
b = c
print(a)
print(b)
